#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sagemaker_endpoint.endpoint will be created
  + resource "aws_sagemaker_endpoint" "endpoint" {
      + arn                  = (known after apply)
      + endpoint_config_name = "thesismlops-staging-endpoint-config"
      + id                   = (known after apply)
      + name                 = "thesismlops-staging-endpoint"
      + tags_all             = (known after apply)
    }

  # aws_sagemaker_endpoint_configuration.endpoint_config will be created
  + resource "aws_sagemaker_endpoint_configuration" "endpoint_config" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "thesismlops-staging-endpoint-config"
      + name_prefix = (known after apply)
      + tags_all    = (known after apply)

      + data_capture_config {
          + destination_s3_uri          = "s3://thesis-mlops-bucket/datacapture-staging"
          + enable_capture              = true
          + initial_sampling_percentage = 100

          + capture_options {
              + capture_mode = "Input"
            }
        }

      + production_variants {
          + initial_instance_count = 1
          + initial_variant_weight = 1
          + instance_type          = "ml.m5.large"
          + model_name             = "pipelines-md07ppmy6e01-CreateModel-CreateMo-qU7kDdhENP"
          + variant_name           = "variant-1"
          + volume_size_in_gb      = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @mattiaboller, Action: `pull_request`*